update
upgrade

cask_args appdir: "/Applications"

tap "caskroom/cask"
tap "caskroom/versions"

brew 'bash'
brew 'bash-completion@2'
brew 'git'
brew 'vim --with-override-system-vi'
brew 'findutils --with-default-names'
brew 'coreutils'
brew 'grep'
brew 'duti'
brew 'git-lfs'
brew 'gpg'
brew 'hub'
brew 'dockutil'
brew 'pianobar'

cask 'macvim --override-system-vim'
cask 'iterm2'
cask 'java8'
cask 'intellij-idea-ce'
cask 'android-sdk'
cask 'google-chrome'
cask 'slack'
cask '1password'
cask 'dropbox'
cask 'flux'

cleanup
