cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"

brew "bash"
brew "bash-completion@2"
brew "coreutils"
brew "dockutil"
brew "duti"
brew "findutils", args: ["with-default-names"]
brew "git"
brew "git-lfs"
brew "gpg"
brew "grep"
brew "hub"
brew "mas"
brew "pianobar"
brew "vim", args: ["with-override-system-vi"]
brew wget
brew gawk

cask "homebrew/cask-versions/java8"
cask "1password"
cask "android-sdk"
cask "dropbox"
cask "flux"
cask "google-chrome"
cask "intellij-idea-ce"
cask "iterm2"
cask "macvim"
cask "slack"

mas "GarageBand", id: 682658836
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
